{"WSJ_VisionProReview": {"text": " You've heard all about it. Apple's... Vision Pro. It's the company's biggest bet yet on a future beyond the iPhone. Let's do this. Yes, I got my hands on it and didn't take it off my face for 24 hours. Oh, amazing. Or at least the better part of 24 hours. That feels really nice. Ever since Apple announced this headset, I've wondered why it's so popular. I've wondered how is it going to fit in our lives? We've already got screens everywhere. What does this $3,500 face computer do better? Since I couldn't test it for long stretches in my real house, can you see my eyes? What's your impression? I know. I headed to the Pocono Mountains and rented this ski cabin because what are these really, if not super high-tech ski goggles? No one's gonna know. So it's noon, which is the start of this journey. What could go wrong? As soon as you put on the headset, you see the real world. Right here is a grid of apps, the home screen. You just look at what you want to select. Then you use your hands to select it. Right now, I'm looking at settings. Now, App Store. Notes, photos, Safari. And to select one, I just pinch. It's really intuitive. And to scroll, you just pinch and drag. The coolest thing is how you can place apps all around you. Apple calls this spatial computing. So I can start writing over here in a document in front of me. I've got email over here on the left, and I've got music over here on the right. I was all set up to do some real work, except one big problem. This is typing. Yeah, it's a struggle for anything longer than a quick message. Thankfully, I have never been so happy to see a keyboard. The real game changer for getting work done, adding in a Mac. We are connected. Yes, you get a giant desktop for your Mac apps and you can run Vision Pro apps right next to them. And you too can have this for the low, low price of... But really, I continued to work in the headset for the next few hours and got a lot done. Next, I had to prepare my persona. Remove Apple Vision Pro to begin capture. Fix my hair, lips. Can I get a light? Keep your arms and shoulders relaxed. See, when you video call in the headset, it can't capture your entire face. Most of the Vision Pro's cameras are pointed outward. So Apple scans your face to create a 3D stand-in for you. Smile with your mouth closed. Capture complete. It says creating persona. What is going on with my cheeks? And when I FaceTime people looking like this, it was universally agreed upon. I think you look awful. It's like Botox from hell. So they did you so dirty, Jo. What? And yes, FaceTiming with other people in Vision Pros is as crazy as you think. Oh my goodness. Sure, there's a lot of remarkable tech here, but can you really take me seriously right now? Apple says the persona feature is in beta. That persona scan is also used to show your eyes on the front display, so people know you're looking at them, but it can be hard to see. I'm looking right at you. Now, it would be around this point where most people would take a break from this thing. I think it was the combination of FaceTiming and screen recording, but the top of this is very warm. I think it's time to switch into the dual loop band. Feels pretty good. I ended up being happy that Apple didn't strap this thing's battery to my head. I got used to the hanging pack, especially when I put it in this. So as cool as a Blackberry holster. I had to charge the battery every two to three hours. So most of the time I just stayed plugged into the wall, but not for my next activity. And here is our recipe, balsamic mushroom and sausage pasta. Crouton is a recipe app for the Vision Pro. So I put the window on one side of the kitchen and got cooking. It is not recommended to prepare food while wearing the Apple Vision Pro. Okay, sure. Don't worry, my producers were standing by to make sure I was safe. Prepping food was really natural, especially. I could cut onions all day in this. My eyes do not burn. This is amazing. But the absolute best thing, so I see the timer here, and now I can move it over the pasta. And now I have a second timer for six minutes that I'm putting over the mushrooms. This is just the coolest. Was it perfect? No. You're still looking at life on a screen. In low light, I couldn't read things with smaller print because of pixelation. Is there even pepper coming out? I cannot see it. And some stuff just didn't look like the right color. But the display quality is far better than the other leading, though far more affordable, headset, the $500 MetaQuest 3. This is pretty much ready. That's very good. What should I watch? Let's start with some Apple TV. You can create a giant personal home theater in the Vision Pro. Because of rights, I couldn't screen record the 2D or 3D movies and shows that I watched. And even then, seeing it in this video wouldn't do it justice. There's Apple TV+, Disney+, and Paramount+. But no Netflix or YouTube apps. You have to watch those through the browser. And the cinematic 3D virtual reality videos Apple's offering… This is the kind of stuff that makes me nauseous. I do like one of the virtual reality features. digital crown on the top of the headset and i am now in a 180 degree view of yosemite if you're like me and glasses on you have to get prescription inserts to use the vision pro i just click in like that. Wow, crazy. Browser, move over. Okay, I didn't sleep with it. I'm not insane. Morning, everyone. That sounds delicious. Siri, what's the weather going to be today? 51, and a chance of rain. Perfect skiing conditions. Let me be clear, no one should ski with these on. Apple's very explicit when you first set up the headset to only use it in safe areas. But I headed to Camelback anyway, and worked with the mountain to make sure the entire bunny hill was closed off from others. And I only wore them briefly to record some video. Siri, record spatial video. Nope, you gotta press the button. Holes on. Gloves on. Here we go. Go. The Vision Pro's ability to record and then watch spatial or 3D images and videos is pretty great. You can record spatial video with an iPhone 15 Pro, but hands-free recording is one of the best uses of connected eyewear, like Meta's Ray-Bans. So what's it like wearing these for a day? Painful, but also insightful. The Vision Pro has every characteristic of a first-generation product. It's heavy, it's battery life sucks, there aren't that many great apps yet, and sometimes it's buggy. No! And oof, personas. But when you imagine a device without those constraints, you see where it could be better than holding a phone to your face. Vision Pro is a cooking computer. For right now, it gives you a pretty great way to work and watch movies. Is that worth $3,500? That's between you and your bank account. But in those 24 hours, I could see Apple's future vision here. A pixelated, yes, and a little distorted glimpse of it, that is. Where are you? Two tech titans.", "sentiment": {"positive": 0.721, "negative": 0.279}, "practicality": {"practical": 0.589, "unpractical": 0.411}}, "MarquesBrownlee": {"text": " All right, so you've seen the unboxing. Now it's time for the breakdown. What is using the Apple Vision Pro actually like? This is easily one of Apple's craziest, most radical, possibly dystopian products of all time. And I have a lot of thoughts here. Like I've been using it for about a week now. There are some parts of this thing that are absolutely incredible and some other parts that feel weird or borderline unfinished. There are all kinds of new technologies from a new operating system to infrared eye tracking to virtually reconstructed versions of you. I feel like there are so many actually new things that you have to understand in order to get a sense of what this headset actually is and what it does. So I'm going to break this down into two parts. This video is all about using the Vision Pro. It's everything I've learned from the past week of wearing and getting used to this thing every single day. But I'm also working on a more wide-ranging, possibly more existential review video. But let's just start with the more hardware fundamentals, right? Like what is this thing that I'm holding, literally? Apple Vision Pro, at its core, well it is a VR headset. Now Apple would never say that and they probably won't like that I'm saying that word. You know, I made an entire video about why they refuse to use those words and they're calling it spatial computing instead. We'll get there. But the truth is, it's a really, really, really high end virtual reality headset. It's something we've seen before, right? It's got displays and lenses and speakers and fans and buttons. And this is a form factor. This is a thing that we have seen before. But before I even turn this thing on, there are clearly several things that are a little different about this one. So first of all, it's made of metal, lots of metal and glass here, which are high quality, but heavy materials, relatively speaking. So there's this precisely machined aluminum frame around the outside. And yes, those are intakes for fans at the bottom and then vents for those fans at the top. On the right side, there's your digital crown that can be pressed in or turned. And then on the other side is just a single larger button. So kind of basically the same two buttons as an Apple watch. And then when you get a little further back on this band here, these little pods with downward facing grills, these are speakers which are pointed straight at your ears and work surprisingly well. Though of course it also means that people around you can hear a little bit of what you're hearing. There's a little bit of bleed. And I have a lot to say about spatial audio, so stay tuned for that. But the main event is at the front. There is an enormous piece of glass, which yes, is very easy to fingerprint and smudge. And then behind that thing, there's this outward facing OLED display and a bunch of sensors all the way around, outside facing sensors that go forward, sideways, and straight down. And there's depth sensors, infrared illuminators, LIDAR scanners, and just regular old RGB cameras, all being processed by an M2 chip and an R1 chip inside this thing. And then maybe the craziest part, inside the headset, there are a bunch more sensors facing your eyes, tracking your eyes in real time for all the eye control and everything that comes with that. And also then to display a representation of your eyes on the outside of the headset, kinda, we'll get there. But overall, when you put it all together, you get a very well-made, very high-end, but also pretty heavy computer to wear on your face. So officially this headset with this Solo Knit band, when I weighed it, showed up as 638 grams, which some of you on Twitter have already pointed out is actually slightly less than the plastic MetaQuest Pro, but that Quest Pro also has a lot of battery on the back of your head as a sort of a counterbalance. So the weight distribution is very different. Also, the Quest Pro is not that comfortable anyway. But the point is, this, for Apple, made the choice of taking the battery off of the headset, which means, okay, now there's nothing on the back of your head, so you can wear it and lean up against things, and that might be an upside, but that also now means you have to deal with this cable all the time running up to your head. And the fact that it's very front weighted now, all of the weight is on the front of your face. So this is the battery as you saw in the unboxing. If you haven't already seen the unboxing, that just went up, I'll link it below the like button. But this battery is a surprisingly small 3,366 milliamp hours. I say surprisingly small because a normal battery bank of this size, you might expect to be 10, 15, 20,000 milliamp hours. I suspect there's a lot of heat insulation happening here, but it comes with a non-removable four foot cable and a proprietary connector at the end of the cable that will twist and lock to the headset. And so the lock is really solid. It makes sense that it's not just straight USB that could get disconnected easily. Once you connect it, it starts glowing and then it starts booting up. And there's even a little Apple logo that displays on the outside screen while it takes a little under a minute to turn on. So there is no on or off button or switch anywhere on this headset, maybe kind of like AirPods Max, something like that. So if you ever take the headset off and put it down, it will enter a standby mode after some time, but it won't turn off. If you want to turn it off, you literally have to twist and unplug the cable. That's the only way to actually turn the headset off. Now, famously already, the battery life with this included battery is not super long on this headset. Two to four hours is actually realistic for what you can expect for just like this built-in battery, but that's also kind of right in line with a lot of other VR headsets, battery life on VR headsets is not that great in general. If you do wanna use it longer, the only way to do that is there's a USB-C port on the battery and you have to plug the battery in. So you could plug the battery into the wall for infinite battery life, or I guess you could plug it into like a, you could daisy chain another battery into the other pocket or something for even longer life. But yeah, two to four hours. Now at first it seemed weird to me that the port is on the same side of the battery as the non-removable cable, but I think it's because they just want you to default of putting this battery like in your pocket, probably in your back pocket. So even if it's plugged into the wall, it can still be in your back pocket. You're just gonna wanna get a longer USB-C cable. So there are no controllers that come with this headset. Now it does support other input methods that are like game controllers and mouse and keyboard, and those can be incredibly useful, but by default, the primary input method for everyone using the Vision Pro is your eyes and your hands. So the first time you put on this headset, it goes through this calibration process and it's pretty interesting. So the first time you ever put it on, it first adjusts the distance between the lenses, physically moving them inside the headset to match the distance between your eyes. Then it does a sort of a hand scan so it understands your hands. And then you go through this process of basically looking at a bunch of dots all the way around the screen and then tapping your fingers together to select them. Kind of feels like an eye test or something. And then you're in. So first thing you're gonna notice is you can actually kind of put your hands anywhere as long as the headset can see this, just your fingers touching together. So there's a lot of pictures of people like using a headset with their fingers like out in front of them, pinching like that, but you actually don't have to do that. It's such a wide angle because of the sensors facing forward and sideways and down. You can kind of just rest your hand anywhere in front of you, in your lap. As long as you pinch like that, it can generally pick it up, which is impressive. So you're pinching to control anywhere in that 180 degree bubble in front of you. And then the digital crown, you hit that once and the app drawer comes up, pretty simple. Doesn't seem that impressive, but this is actually a peek at the first really impressive thing about this headset to me, which is it seems to have incredible spatial positioning lock. And like, it's really hard to show, like have you appreciate this through a YouTube video, reviewing VR headsets is hard, but like turn around in the room you're in and like picture a wall or a window just appearing locked in place in 3D space in your room. And no matter how much you move your head or move around, it stays exactly kind of floating where it's supposed to be. But when I say floating, I think you're picturing like a soft float, but it's locked and that's how it starts. So now you're in Apple's new Vision OS. I would describe this as kind of similar to iPad OS, but way more glassy and like, of course, with the extra dimension of 3D space. So hitting a digital crown will always get the app drawer back in front of you. And then simply look at the icon you want and pinch your fingers together to select it and open that app. Scrolling is basically as you'd expect. You just kind of pinch and grab in the air and then pull as if it's on a string and physics let you pull things through the air. It's pretty intuitive, it's responsive, it's fluid. Sometimes it's kind of bouncy even. I would say the biggest adjustment is only being able to control exactly what you're looking at. And I don't think people realize how often they're controlling things that they're not exactly looking directly at with other computers and other UIs. But with this, you can look at the button to select it, and if you look at the next thing you're gonna do, you're no longer controlling the button. You have to look exactly where you're trying to interact with things. It takes a few extra brain cycles to remember to always be looking exactly at the thing you're controlling. So when you open a window of a Vision OS app, like any one of the default Apple apps here, it locks into place, it's floating there. It kind of looks again like an iPad app, but very glassy, like this frosted glass around the UI sort of lets you see through a little bit to the color behind it. And it even sometimes casts a shadow on the ground in the correct Z space. So it really solidifies that it's floating in front of you. All this makes it feel like the window is in the space around you. Then if you look at the bottom of the window, you get a little bar. You can always just look at that bar and pinch to drag it around. So drag it forward, backward, anywhere you want in X, Y, and Z space, and then let go and it just stays absolutely locked. And then you can look at either bottom corner to resize, to make it bigger or smaller. And then finally, there's a little X at the bottom. You select that, that closes it. So that is the basics of Vision OS and just using an app. Now, this entire time, by default, and almost anytime they can, pass through is on, which means you have the headset on, but you can see with the cameras right through to everything around you. And I think this is where Apple really wants to normalize the term spatial computing, because it feels like augmented reality. It feels like you're always able to see the space around you. But technically it's not actually AR because you are still looking at a reconstructed version through a camera feed of the world around you instead of the actual world around you. but maybe it's all just semantics. I will say this is the best pass-through of any VR headset I have ever used, and it's not even that close. Now, again, it's so hard to get this through a YouTube video. It does have screen recording built in, so I'm gonna try to use that, but imagine putting a headset on and not really feeling like you're looking at a screen with the real world. Because of the pixel density, because of the 90 Hertz refresh rate, and because of the impressive dynamic range of the cameras and the correctly adjusting shutter speed, You just almost don't, you almost just feel like you're looking at the real world, not through a headset. Also, the pass-through is so close to real time that I could legitimately interact with all kinds of things. I could catch items flying at me. I even tried playing ping pong. It was easy, no hesitation. So officially the R1 chip is doing all the processing of all this stuff and adjusting the shutter speed for different lighting conditions and always keeping pass-through latency under 12 milliseconds, which is the lowest in the industry. But it's really combining that with how close to reality the colors and brightness and everything are that keeps it feeling kind of real. Basically, the only noticeable restriction is super close-up items and objects can get a bit blurry, and then you can't quite make out like really small or fine texts. So you can't like read an email or tiny text on your phone in your hand, but you can absolutely text people or read your notifications while keeping the headset on. If you've tried other VR headsets, you know how impressive that is. It's just, it's really good with the tech that exists now for VR headsets. But you can definitely still take the headset off and be like, oh, it's way brighter in here than I thought it was. Either way, that's all pass-through, but if you ever wanna fully immerse yourself, I mean, it is a VR headset after all, all you gotta do is rotate this digital crown clockwise, just keep turning it, and it will slowly dial your environment more and more into your field of view until you dial it all the way up to fully surrounding you. So all of the windows you might've had open will still stay stuck where they were, but everything you're doing is just on the moon now. So yeah, there's a couple environments Apple has built in here, most of them relaxing scenic locations like in California somewhere, or one really nice one is Mount Hood with a little bit of rain falling. They're not quite photo realistic, but they're just short of photo realistic. Like they're the most realistic digital environments that I've seen. So then the last two big quirks of the UI. Control center. So the only way to get to control center is to look up, and you can't just look up, but you have to physically turn your head up and look at this arrow that appears above you. So once you see that, you select that, and then you get your control center for things like, you know, battery life and notifications, focus modes and screen recording. and pairing to a Mac. But the other big quirk is text input. So you might be wondering how does text input work with no physical controllers? So there's basically three ways to do this. So let's say you're in Safari and you wanna go to mkbhd.com. You really want one of those shiny new Chevron hoodies for the rest of winter, great. How do you do it? So the first way is to literally hunt and peck, poking the keys on the keyboard that appears in the air in front of you. So this one is tough because it literally only reacts to your pointer finger on each hand. So you actually can't type fast like with Home Row or anything like that. Not great. The second way though, I think is actually kind of good. It's at least faster, which is looking at the key you want to interact with and then pinching to select it. So just looking around the keyboard like this and selecting the keys. And you might be surprised how fast you can type like this. If you actually know your way around a keyboard pretty well, I actually prefer this to poking the virtual keys because I at least get a little bit of haptic feedback from my own fingers tapping together. But then in Safari, the last way to do it is literally to just look up at the microphone and say the URL out loud, mkbhg.com. And then it just hears you and goes to the site pretty quick if it's a URL that you can actually say out loud. So what can you actually do with this thing? Like now that we know what it is, it's the M2 chip, a computer on your face with the displays and the lenses inside all sorts of sensors everywhere. What can this thing actually do? And I feel like the most common way to phrase that is, what is the killer app? Because that's, we feel like we need some sort of justification to spend three, $4,000 on this thing. Like applications made the iPhone what it is as we know it. Like apps made the iPad. So what is the app situation on the Vision Pro? So there are two types of apps on the Vision Pro actually. The first is apps that are built specifically for the Vision Pro to take advantage of its awesome experiences. And there are a few of those right now. And then there are all of the other apps, which basically are iPhone and iPad apps that happen to be compatible because the developer didn't opt out. And the first kind is way cooler. So these are Apple's stock apps here that come with the Vision Pro. And so these are all of course, made just for Vision Pro. So they're gonna have stuff that takes full advantage of what this thing is capable of. Apple Music is a pretty classic one. Like it has all the same functionality of any other Apple Music app, but in this super glassy frosted window and shows the colors of whatever's behind it. And you have the sort of sorting menu on the left-hand side instead of across the bottom. That's the basic layout. Same thing with the Notes app and the Settings app, very glassy, almost looking like an iPad app in the air, just rebuilt with this new material design. And then there's the media apps. So Apple TV and Disney Plus, they both come pre-installed, which they have built entire environments inside of them for watching media. And there's even a small collection of videos on the Apple TV app that are shot on a new proprietary format specifically for Vision Pro. So it drops you into a space with a full 180 degree video and Alicia Keys walks right up to you and starts singing right to your face. It's crazy. There's also the Photos app, which will let you look at panoramic photos, for example, in this fully immersive view. So you can blow them up to full screen, and then it gives you a bit of a parallax effect around the edges. So it feels like you're looking into a window of your own photo and looking around. It's kind of incredible. And then there's also some other really fun third-party apps that I've tried that were built ahead of time. So Sky Guide, this is a good one. You can look around a real representation of the sky around you, or any of the constellations would normally be. You can look at it a little longer and it'll pop it out. You can pull it out of the sky to get more information about it. It's a pretty great idea. There's another one called JigSpace, which is, it's a sick app. I don't know if I'd ever use it, but basically it lets you load 3D models into the space you're in and mess around with them. Take them apart, view them in actual size. And this really takes advantage of how good the placement lock is on the Vision Pro. And you can walk around and really gets you a better understanding of the scale of things that you don't get to see up close very often. And then Keynote is another funny one. So you can, of course, go through and edit a keynote just like normal if you want to, but then they've built this whole environment for practicing your presentation skills. So you press that and it says, oh, would you like to go to a conference room or the literal Steve Jobs Theater? So you can rehearse talking to your audience with your keynote slides behind you. It is genuinely incredibly immersive. And there's already a bunch more apps like this in the app store already at launch that are specifically built for Vision Pro. So they'll take advantage of its various strengths. Now, are any of these a killer app? Not really. I mean, I don't, if you're looking for any one of these to be the reason why you spend like $4,000 on this headset, I don't think we have that yet. But then at least there's all the other non-native, but technically still compatible apps that are in the App Store. And these are gonna look just like iPhone and iPad apps. Actually, there's a pre-installed folder on the home screen when you get this thing, literally called Compatible Apps. And there's a bunch of them from Apple here. They look exactly like iPad apps. I'm surprised actually that more of them aren't fully built out to take advantage of Vision Pro, but like Apple Maps is just the iPad app. And so it would be cool if there were some like fun augmented reality overlay walking directions type stuff, but nope, it's all the exact same functionality that you would find if you open this app on your iPad. And you can go to the app store and search a bunch of the names of apps you already know and love and find them by name and grab them and they'll work the exact same way. Crazily enough though, there are already some notable exceptions. No Netflix app for the Vision Pro, no YouTube app for the Vision Pro, no Spotify app for the Vision Pro. Apple has a kind of a contentious relationship with a lot of developers right now, especially some of the bigger ones. And so some have made the active choice to opt out. They're like, we don't wanna be there. This won't be a big enough platform to matter to us to justify the work, so they're not there. Now I totally get it, but also now as a Vision Pro owner and someone who's using it, I'm like, oh, it's kind of a bummer. I really wanted to be able to watch like a Netflix show offline downloaded ahead of time, but you can't do that now. But at least, at least for now, for the record, you can use the browser and anything that would work in the browser. So if you pull up Safari and you get a full screen 4K YouTube video going and locked in space or even in an environment, it looks great. It's razor sharp. Like I could totally watch YouTube videos like this, but you will definitely be missing like the features of having a dedicated app like offline video. Honestly, to me, the killer app of the Vision Pro isn't just an app, it's actually the ecosystem. And we knew this was coming, but the second you log into a Vision Pro with your Apple ID, immediately it starts pulling all the services and all the stuff that you're used to from all the other Apple devices you already have. And I said this before the Vision Pro was announced, I was like, this is the most obvious strategy for Apple because there are lots of people out there who have never considered buying a VR headset that are considering only this one because they have an iPhone and this is the one that works with the iPhone and none of the others are particularly close. So all of your iMessages are already here, all of your photos are already here and loaded up and backed up, all your notes are already at your fingertips, you already saw the Keynote app, but okay, easily my favorite feature is connecting to your Mac, right? So anytime your Mac is in front of you and it's turned on, hit that arrow and then there's this little icon to become my Mac's virtual display. So I click that and then pick my Mac and it pretty much instantly, it actually blacks out the display of my Mac and then turns that display into a 4K window inside of the headset. So now my keyboard and track pad still work, even if it is a desktop, the keyboard and the track pad still control everything and you can continue using it just like a normal computer, but with the ability to make your new 4K monitor as big or as small or close or far away as you want, which is super sick. And then the bonus is you can still open up and place other Vision Pro apps around your Mac computer. So like you can have your Mac in the middle here, and maybe you're editing or doing some work on the Mac app, and then you have a Safari window or messages or whatever else you want right next to it, around it. And then your keyboard and track pad can move seamlessly between them all to control all of them. This to me, as a Mac user, The ease of use for setup to make this happen, this feels like the biggest game changer, like the most compelling, futuristic feeling use of this headset to me, especially on a plane. Oh my God, I can't tell you how many times I've had an awkward conversation because like I'm editing a video on the plane, the person next to me sees I'm editing a video of myself and it's kind of weird and hard to explain, but I'm picturing putting the headset on, the display blacks out, but now I can do all the editing I want and I can make the screen as big as I want. So I've really enjoyed using that feature. Again, the biggest challenge though is still remembering to look exactly at the thing you want to control. So aside from typing on the real keyboard on whatever window is open, if you wanna control something, you have to be looking at it. Again, it doesn't sound like a big deal, but when you try it, you'll see what I mean. And then also, odd limitation, one monitor only from the Mac, one virtual monitor only at a time. So if you usually run like a dual display setup like I do for Final Cut Pro, big preview on one side, timeline on the other side. You can't do that. You have to use the big one monitor version of your setup. All right, so you might've realized I've left one thing out this whole time. One thing, you could call it one more thing, sure. It's one more huge, crazy thing, but it's kind of the defining characteristic of this product and that is personas. So in all the advertising you've seen of Vision Pro, There's these eyes on the outside of the headset that looks like they're kind of in like a pass-through, like in a dark astronaut helmet type of thing. Easily the most memed, most unique aspect of this headset, right? It's the only headset with an outward display. And I mean, it's very, very prominent in those videos. But in real life, as you've started to see from some of my footage, it is very different. And I think I figured out why. So first of all, it's not actually see-through, right? There's a whole bunch of computer in between me and you right now. So the eyes aren't on the outside. It's a representation of my eyes based on what all the sensors on the inside are seeing. It's reconstructing it on the outside. So those sensors are tracking at 90 frames per second and they give you optic ID, which is it's how you log into the headset and keep things secure. It's basically the same as face ID or touch ID. It's just looking at and identifying your eyes. And it also powers the one beta feature of this headset, which is personas, which is, it's the most impressive and weirdest thing about this headset at the same time. I'm calling it right now. So the purpose of the eyes on the outside is really not for you, the wearer of the headset. In fact, you'll never see it, but it's for the people around you. So when you're in a pass-through mode, your eyes will shine through to indicate that you wearing the headset can see the person outside. So that right there is already pretty unique. But then when you're in something immersive and you can't see what's around you, it covers up your eyes with this sort of like a blue, purple glowing animation. So that intuitively makes sense. You can see the eyes when they can see you, you can't see the eyes when they can't see you. But crazily enough, there's also a feature where if you have someone who's outside the headset looking at you, talking to you, and you are in an immersion, but you want to talk to them through that, they will kind of appear through the fog of whatever immersive environment you're in. So you just start talking and looking in their direction. It detects that and sort of parts a little bit of a fog and that person's eyes will show through the fog. It's pretty decent. It basically only shows one person at a time. And when this is happening on the outside of the headset, it shows a little bit of your eyes poking through the purple and blue glow. It's, as you can see, it's all working, but also I think it looks nothing like the eyes from the ad. So in an effort to make the eyes as presentable as possible, two things. First of all, this screen is actually behind a lenticular film, which I didn't even realize that from the initial media they've published, but if you've ever heard of that, it's sort of what gives it like this 3D depth. You might've seen this on other like holographic displays and stuff, but the point of that is to make the eyes appear to be sunken into the display, like on your actual face, instead of like glued to the front of the headset, which would look a little more weird. But then two, to represent your actual eyes, they've built in a way to scan in and create a digital representation of your face, which is called your persona. And it looks like this. So to get those eyes on the outside of the Vision Pro headset, you have to do something called registering your persona. This is how it creates the digital version of you that includes your eyes that will show up here. So let's do that now. It's actually kind of a cool process. So I'm gonna put it on and hopefully the screen recording works so you can see exactly what I'm doing. I'll hit the digital crown. I'm gonna go to settings and you can do this when you first set it up, but I'm going to persona and I'm gonna hit get started. So let's refine my hands real quick. Captures, this is capturing detail from the front of the headset of the hands in front of me. Once it's done with that, it's gonna ask me to take it off. So, this is how it goes. Hold Apple Vision Pro at eye level. Keep your arms and shoulders relaxed. Align your entire face within the frame. My face shows up like face ID. Slowly turn your head to the right. Now slowly turn your head to the left. Now tilt your head up. Then tilt your head down. Next, let's capture your facial expressions. Smile with your mouth closed. Then make a big smile with your teeth showing. Now raise your eyebrows. Close your eyes for a moment. Capture complete. Put Vision Pro back on to continue. I will do that. So now I have a menu that says creating persona and it says it's in beta and now there's there's my persona right there kind of uncanny the hair is a little bit different but the face Wow Wow okay so there's different lighting you can choose it to always be in studio lighting and always be in contour lighting I'll just leave it at natural and hit next you can change the color temperature of your skin tone cool to warm I think I'm around there brightness darkness I think I'm around there near the middle next and I can add glasses so if I typically have glasses which obviously I wouldn't be able to wear in the vision pro you can still look like you have glasses anytime you're on that FaceTime call. And then next, save, and that's it. So I think now you should see my eyes. Maybe. And that's the thing, it barely shows up. You can barely see my eyes when I'm wearing the headset. Now I've tried a couple other scans subsequently, So I've tried different lighting conditions. I've tried different backgrounds, simple backgrounds, tried different shirts and things like that. It doesn't really ever appear any brighter. I think if you have a darker skin tone like me, just don't expect the eyes to show up very brightly on the outside of the headset. It's pretty subtle. Even when it does show up, it's a little weird looking. The eyes are a little too far apart sometimes. They're a little dim. You see like one eye at a time. It's kind of weird. But that persona though, that is some pretty interesting stuff. It's crazy that this is actually a real thing being shipped. Like first Meta started doing it, now Apple's doing this. This is, again, it's technically in beta. So I don't know, there's room for improvement, but it still works. But as of right now, I feel like this is both incredibly impressive and slightly unsettling. Like it's very impressive that this thing, This headset I'm wearing on my face is tracking every, all these little micro expressions and little movements for my eyes and my cheeks and my mouth and everything. But at the same time, it's just quite, not quite human. It's right at the edge of the uncanny valley of I'm not looking at a person. So yeah. But the crazy part is you can now use this persona as your camera feed for any apps in Vision Pro that require a front-facing camera, like FaceTime. And so I've tried, I've been using FaceTime a few times in the Vision Pro, and it is technically speaking, incredible. So I've made a few FaceTime calls in the past few days with some fellow reviewers who you'll probably recognize from their personas who are also testing the Vision Pro. And universally, once we all got past the shock of, oh my God, it's you, it looks like a digital version of you, This is crazy, I've never seen anything like this before. Once we got past that, there is a ton happening here. So you can see the FaceTime windows literally appear as just that. They're just like glassy windows floating in space with people looking through them. And then the angle that you look into the window is gonna match the angle that they see you looking at them. Meaning if we're all Envision Pros on this call, unlikely, but hear me out, If we're all Envision Pros, and you've got a bunch of people on this FaceTime call, so there's somebody to the left and somebody to the right. If I look to the person and make eye contact with the person to the right, the person to the left sees like the side of my head because I'm looking at somebody else. That's already pretty cool. And then the same thing is true for hand gestures. So we try this out. Turns out you can reach out and make hand gestures that are tracked by the cameras in this bubble in front of you, and they show up at the correct angle towards the person that you're gesturing at. So not towards everybody else on the call. Oh, wait, wait, that's okay. Good test. So wait, Justine, do you see this? Yes. And Brian? I don't see that. I don't see that Marques. Now wait, so now Brian, do you see this? Now I can see that Marques. And then on top of that, spatial audio here is incredibly well developed. So again, you're on the call. The voice of the person to the right comes from the right side. The voice of the person to the left comes from the left. But also, you can just pick up and move the window around, and that angle will match where the people are in the room and where their sound and video comes from. If I put you on the other side of the room, it sounds like they're further away. And if I turn up the environment and bring them into the moon or some other 3D space, it actually sounds much more like I'm in a gigantic space with no echo versus in the actual room. It's all very subtle, but very well considered. So once you're in this a while, you start to notice all these little smaller things. Again, it's not quite human-like. It's not like looking at a video feed of a human face, but it is still, like it has a lot of, like this would be the best avatar anyone's ever made in 2K. Like no one's ever done a 2K face scan and had it look this good, but it's still not as good as like a perfect reality. It's a, you've heard the Uncanny Valley thing before. I think the number one weakness for the avatars the personas that I've seen is hair. So basically everyone I've talked to has like a frozen lump of hair instead of flowing realistic hair. And that's true about all flowing things. Like however your hair was when you did the scan, it's frozen that way. And so is any necklace you're wearing, whether it's crooked or not, or I guess technically also any makeup you had on or however you looked when you did the scan. Maybe that could be a good thing. Maybe you did a scan when you were looking all dolled up and then you get on a 7 a.m. call and you still look perfect even though you look like you just woke up in real life. So I guess there's that too. But anyway, all that is to say, FaceTime, FaceTime is the most well thought out, like most futuristic Vision Pro experience. It just is. So I'll end this video with this. Now you know what it's like to use and operate the Vision Pro, but there's still a lot more to consider when actually considering if you should buy and own this thing from the use cases to the things that work well and don't work well, the philosophy behind it, the prices, all of that stuff. That's what's gonna be for my full review. Like there are parts of this thing that are absolutely amazing, unparalleled, best I've ever seen. But the reason it's so interesting is because it's actually a young category. Like we're so used to this slow, boring iteration in mature categories like smartphones and laptops. And you always see the comments talking about how tech is so boring, but now they're actually jumping into something risky and it's actually fun. And there is downfalls and flaws, and it's fun to actually weigh the pros and cons. So I'll be expanding on all these way more in the full review, but I'll leave you with this. I've got my upsides and downsides to Vision Pro. It's been a week. Upsides, some of the stuff that's the best I've ever seen in a headset, immersion, placement in space, eye tracking and hand control, pass-through, ecosystem, and spatial audio, and the downsides, weight and comfort, the eyes on the outside, app selection right now, battery life, and price. So the full reviews and the works, definitely get subscribed to be among the first to see that when it drops. Either way, till the next one, thanks for watching. Catch you later. Peace.", "sentiment": {"positive": 0.665, "negative": 0.335}, "practicality": {"practical": 0.511, "unpractical": 0.489}}, "BrianTong-Review": {"text": " Siri open messages. Siri open photos. Oh, so cool. Put this over here and look up and oh, wow. Wow. Wow. Siri, take me to Yosemite. Siri, close all my apps. Are you kidding me? Holy shit. Oh, hey there, what's up everybody? Brian Tong here and this is my review of, yes, the Apple Vision Pro. I've had it for about a week, been one of the few lucky people to really dive deep and get into this. And, you know, if there's one word that I could say to explain this, like one word, it's immersive. And we're going to talk all about this because there is truly no other thing out there on planet earth like this. This is one of a kind and I'm sure, you know, everyone wants to try to make comparisons, but this is a whole new approach to the mixed reality space, augmented reality, virtual reality, mixed reality. And this review is going to happen over multiple days because there's just so much to show you and experience. And the Apple Vision Pro, this is just different from the moment you look at it. The hardware, the elegance, the quality materials. Like you can check out my unboxing for a real up-close look at it, and just even how to properly fit either this solo knit band or the dual loop band. I show it to you all, but for me in this review, I want to bring as much of the experience to you as possible, right? I want you to see what makes this special, what makes this different, and obviously, look, I'm gonna say it right off the top, go check this out at an Apple store for yourself. For those of you that pre-ordered it on day one, hey, that's you, but that's not everybody. Most people are still considering, is this something that I really want to invest in? $3,499 starting. So that's what we're gonna hope to answer. Now, enough of that talk, right? Let's talk about setup. Setup starts with a eye measurement. Then you do a hand scan, your palms, put your palms out. And then there's three different calibrations for tracking your pupil because of dilation. So it's done in different lighting. It's this fun little pattern of dots that you tap with your finger. This is kind of like the universal sign for Apple Vision Pro, right? Because look, this is what you're gonna use. You don't have to have, you don't need controllers, except if you wanna use some certain games, but it's your eyes and your hands, and these are your primary tools. So let's show you how to use them all together. Now, we already did the setup, all the calibration, and obviously eye tracking is a big part of this. So let's go to the home screen. I'm just gonna click the digital crown here, and what you'll see is, right now, what I'm staring at is what will be in focus for you, but I'm staring at the icons here, and that's just using my eye. You see them kind of come forward, all right? Because everything I do is with my eyes. If I want to select something, let's go to somewhere like messages. Let's just do a pinch or a single tap. It opens up the app. Look, everywhere where I look, you're seeing it get highlighted. The eye tracking is incredibly accurate. And so when you first use this, you'll be flying all over the place, but it's amazing. Okay, so we have the single tap. I can close this or if I want to show you something else, let's do a pinch and hold and on that bottom bar here, that allows me to manipulate this window however I want. Bring it close, push it out far. I can even look on the right hand corner to expand the size of this. This is like scaling it, right? Bring it out, smaller, depending on where it is. So there's a difference between positioning it closer to you or further away from you. And then also if you want to do something like pinch and drag look I can scroll up and down here by pinching and dragging holding it and going up and down that's pretty neat let's go to somewhere like our photos okay I'm gonna select this here's our photos again pinch and drag hold it in spot right to move it up again I can move this window around let's go into a specific photo here and this is a fun one and also similar to like multi touching your on your phone I have this photo here let's take two hands now and I can scale increase the size to zoom right pinch to zoom pinch to shrink it in within the space of the window here all right and then I can single hold and move this around wherever I want oh this is so so freaking cool and then I just tapped it to kind of get back to the regular size but then let's also show you some other gesture here I'm gonna go to let's do a pinch a drag to scroll through this right one move and there's an app called jig space and it brings in 3d objects into an environment so I'm gonna go to this Alfa Romeo and it's gonna load it in a moment but I'm gonna show you some other cool things that you'll be able to do all right tap to place your jig this is a 3d render model but think of this I'm gonna I'm gonna rotate and manipulate this space well so going to take my two fingers pinch together and look now with this app and this specific gesture i'm rotating the alpha romeo i can also scale it and bring it up really big right i can push it in and tiny this is all done real time um i can even get close up and i think i can look at parts that and pinch out pinch off the tire here all right i can basically break this car down and pull it apart well this tire is really big here can you get on my way okay thanks buddy but this is again some of the magic ways of using the gestures from tapping a single tap pinching a hold manipulating rotating zooming hold up i almost forgot there's so much stuff here that sometimes i do forget things so let's just go to my mail real quick and i talked about a long press to to drag but for content let's say you want to share things hold and typically contextual menu will pop up and that gives me options like open link add a reading list copy link I could share this click on that and then here I can share to friends airdrop message mail however I want there's just so many things that you can do here app developers can make their own one specific to their app so when I say multiple times here we're just scratching the surface. We are scratching the surface, but so many really cool things that you can do here with Vision OS. And yeah, we're just getting started. It just feels so natural, and you're going to pick up using the OS right away. So I think the big thing about the eye tracking is we've seen it on something like the PSVR 2, but it was only used in maybe a few functions of games but eye tracking here with Apple Vision Pro and the Vision OS is used the entire time to navigate it using hand gestures are being used the entire time so it you don't hold anything it just really right away just feels second nature I will say that you know because when you jump into this for the very first time you're gonna be juiced up you're gonna be amped up just because of the fidelity that you see you've never seen anything like this in a consumer device and I found myself just my eyes fluttering all over the place looking everywhere and so you almost have to like settle yourself down when you get inside here but you know in the very beginning of this video I showed you multiple apps you can literally surround yourself you can put different apps in different rooms of your house and then they'll stay in that place then when you walk over to that area you'll be able to navigate with them you can do a lot of that but look let's just get into the first experience and that's starting off with spatial computing you know we're gonna do a little show-and-tell here because this is all about experiences I'm so excited for you because look this is the first time that we're gonna be able to see this in action so I have vision Pro on obviously look over here I have my m1 max MacBook Pro this is my workhorse and I'm using Adobe Premiere so you see the option to connect to it So I say let's connect, right? I'm going to select that. And it's literally just going to take a few moments and. Voila, we have a 4K display Mac OS in front of me now integrated into VisionOS. I can take right just like you'd expect this app and I can move around. I went to the screensaver, so let me get back here. All right. I can move this around wherever I want in space. I can bring it up here. Let's just put it right here in this nice sweet spot for me. right my trackpad on my mac is obviously what i'm going to use to control mac that this is my desktop right just in a large screen so i can scroll through video here i can play let's do this video here the alternative light seal cushion and again i can go over here and look at my assets and just drop them in however i want just like i'm i'm just like editing this is real time the latency you don't feel it at all so that's pretty cool but should we bump things up a notch yes of Of course we should. Siri, open messages. So the Vision OS app appears. I can move it around again however I want. Let's do another. Siri, open Safari. Oh, that's pretty cool. Maybe we'll have to revisit that later. But okay, I have these three apps around me, Mac OS and Vision OS, but here's where it gets saucy. I'm gonna take my mouse cursor and just pull it over. And what do you see here? See that little white cursor, what you're familiar with with iPadOS because that's the foundation of VisionOS apps. I can freely, I'm using the trackpad on my Mac to control this VisionOS app. I'm navigating through it. I'm using it. Like this is freaking wild and amazing. I can play, you know, whatever media content. I can scroll up and down. All right, let's go back here. Now you can see my trackpad on the Mac in Adobe Premiere. and let's go over here to Safari. Oh, there you go. Should we play a little bit of this? What's your hair stripe gonna look like? I mean, it kind of looks blended. Y'all, this is Mac OS, Vision OS, two completely separate OSs working seamlessly in spatial computing. This is insane, and it works flawlessly right out of the gates. It is so impressive, right? This is, again, Apple's ecosystem coming together. And, oh, I could see myself doing things like, instead of bringing a workhorse like this, maybe something like an M2 MacBook Air, smaller in size, portable, more light. And then with Vision Pro on a plane while I'm traveling, pop this open to edit on a huge 4K screen. That's a higher resolution than the M2 MacBook Air. This is something that I'm absolutely gonna do. The text rendering is so sharp and clean when you're looking inside the headset. This is just an amazing experience. And you can even see when I stare at things on here, right? It still is using VisionOS and my eye tracking if I want to, but you also have the capability to use it, either VisionOS or MacOS like that. Are you not wowed yet? I'm wowed and I've done this multiple times and there's a lot more to show you. Now you have native apps that are built for VisionOS. You also have compatible apps that are either iOS or iPadOS that have been turned on. You will find those in a folder on the home screen that's called compatible apps. But enough of me talking, let's now show you another example of just some of the very, very first apps that are out there. What's up everybody? Welcome to Club BTZ coming to you from the moon. That's right. I'm in the moon environment and you know what? You might've heard of the DJ app, but they're doing a whole lot of different things here in Vision OS. launches let's get going Siri open DJ and you might be familiar with this the two turntables I've already loaded it with two different songs you can select them from your music library but I'm just gonna play the first song on my left play this record the gang and then I'll play the right record over here and you have the fader that I can slide in between right you know how to do this right this is fun but you know this is pretty standard mix around play with tempo but let's take this to the next level alright I'm gonna go in here to that icon here for basically like environments let's go to the wall and just give it a moment it's asking me if I'm ready to get immersed and here we go oh the DJ table pops up I'm gonna even take this DJ table move it down to my actual table alright and again you can play with different things I can even scratches what I can switch between here on the fader oh but then you want to have some fun here look at this icon over here right that headphone I'm gonna click on it this allows me to use a gesture now to preview the song on either side so let's go here on the left side I put my hand over my ear you can't hear it but I can hear the song on this record that is insane I can play here I I can scratch the records if I want. Oh. Okay. Also, let's go in here to FX. And a new kind of panel will show up here. What I'm going to do here, well, hey, let's just play around. Oh. Oh. Oh. Ha ha. Ha ha. Oh. Uh. I mean, look at the club. Uh. Everything is on me. Uh, uh, uh, uh, uh. Okay, you're seeing my view from inside, but this is just a day one app, VisionOS, just to give you a taste of what's possible. Not only mixing music, coming into these environments, and then the gesture to sample and preview the other song. Oh, this is wild. You wanna see more cool apps? Of course you do. I'm a huge NBA junkie. During my downtime, I have NBA League Pass. I'm watching games on my TV all the time, but there's an NBA app for Vision OS, so maybe we should check that out, all right? Siri, open NBA. So this is the app. You have the games that you want to see during the day, but again, this is either games that are archived or games that are live. So, you know, there's no games happening right now, but obviously that Lakers-Warriors game was insane. Two of the great ones, LeBron, James, and Steph Curry. So if this was, you know, the day of, I would hit, yeah, I'm going to watch now. And what you'd get is a stream of the game playing. Now I'm going to pause this so we can talk about this, right? So let's say the game is playing, but I want to see what other games are happening. I also want to see what's happening in this game. So I can click on team stats and real time, they update while you're watching the game, field goal percentage, three pointers, three throws. Don't want to look at player stats? Over here on the right side, you can look at the teams and each individual players. Let's obviously go check out the Warriors. Steph Curry had a beast of a game, 46 points. Also got to wrap my man up and coming, Jonathan Kaminga right here, 22 and nine. But you can look at all this real time as it's happening. And I was instantly already freaking out. I'm like, oh my gosh, this has made my viewing experience so much better. But then I look up there and I was like games and so I click it I'm like, oh wow all the games that are being played whether they're live or archived for the day are here Let's go to a rivalry like Miami, New York and I click on it says watch game I could swap it in or I could add to multi view So also in one pops up that I'm like, oh crap like I can watch on the big screen or I can have it here Let's go to another game. Philadelphia, Denver. Yes, please. Add to multi-view. So now I have three, three screens, three games. Um, what else? LA Clippers, Boston. Yes, please. Add to multi-view. That goes there. Uh, New Orleans, Milwaukee. Add to multi-view. Do you see what I'm seeing here? We literally have five live streams or archive streams of NBA basketball in my face. I'm freaking out. I'm like, this is incredible. I can take a game over here and if I want to, I can swap it in and play it on the big screen. And then my Warriors game and Lakers game, maybe it's starting halftime goes over there. I can watch the game here. Then what do you normally do when you're watching sports? Um, yeah, I'm messaging my friends in the group text Siri open messages so that pops in over there I could be browsing the web here this is insane this is a sports fans wet dream and it is incredible this is again a day one or we're at day zero right now launch app for the NBA you can only imagine how other sports leagues will model this then you also think about the future of apple has mls apple has major league baseball apple also has their apple immersive video platform which we know can do sports games so this is just again scratching the surface of what is possible and it is so exciting look if you're an nba fan how can you not freak out about it i'm freaking out about this this is incredible are you freaking out yet you should be freaking now because this again this is just the first day one apps that just shows just just a sliver of the potential of what is possible and your mind just starts going in all these different directions now the biggest thing using vision OS the speed of the OS running on an m2 I never questioned whether it was too slow whether it was laggy where it didn't feel like it was flowing the The display here supports 90 hertz, 96 hertz, and 100 hertz refresh rates. Those different refresh rates are depending on the type of media content or even overseas in let's say like in Europe, they have a standard 50 hertz, so you gotta have 100 to kind of match that with the multiplier. If you're watching something like 24 frames per second movies that multiplies into 96 seamlessly, and then 30 frames per second that multiplies into 90 hertz. So there's a reason why this display, it looks buttery smooth. Some of the screen captures that I have, yes, I'm screen capturing it. So you might be like, that doesn't look, maybe there's a moment or two where it might be choppy, but trust me, when you have this on, you'll never question everyone that said, oh, why don't they put an M3 in it? Yes, we know the next gen GPU is in the M3. I said from day one, the M2 has more than enough overhead support this and try this, experience it, go to store to check it out. You will never say, oh this feels, this feels slow. Also, we talked about eye tracking and hand gestures. You're gonna be reliant on Siri a lot more. I used it to launch apps, to close apps, to jump between environments, and even because, let's be honest, you can use the virtual keyboard and I've gotten a little more used to it but it's still not ideal ideal when I have to, yeah I'll deal with it but you know even using your voice to send text messages through Siri that's gonna really be one of the main ways that you communicate with it. Yes you can use a trackpad, yes you can use a physical keyboard and they connect over Bluetooth nicely but you're not always gonna have those accessible next to you and handy so look you're gonna rely on your voice, your eyes, and your hands a lot. Also, if you're talking about, okay, well, how do I make payments? What if I'm purchasing new apps? Well, you're not using Face ID because your face is covered, but you're using their Optic ID system, which basically does a scan of your eye, which is unique to each person. So that's how they know who you are. But also, Optic ID ties into your persona, right? If you haven't heard about this or seen this, the persona, this is your digital avatar, and you build this directly on the Apple Vision Pro. Now this headset is also for one person, but there is a guest user mode. So this is, you know, I talked about Optic ID. This is really truly tied just to one user, but you can share it. You can give them access to the apps that you already had open before you hand it off, or you can give them access to all the apps on the Vision Pro. It's also recommended that a person who wants to try it on as a guest gets their own light seal, gets their own sizing for Vision Pro just because that'll give them the optimal fit. That costs $199, but they can get their own through Apple. But this does support guest users. So let's set up our persona. I'm going to jump in here and go to my settings. And then we're going to find persona. Go there. Now I have one in here, but I want to walk you through the process here. So I'm going to go to recapture. And here you go. Capture how you'll appear in FaceTime and other calls. So let's get started. Okay, refine your handset. I'm gonna put my hands out. Flip my hands over. This is for hands tracking and hand scanning. Okay. To set up your persona, you'll remove Apple Vision Pro. They'll walk you through this tutorial video, which I've done before, so I'm just gonna say continue. Take your time getting ready and make sure nothing's covering your face. To start capturing, hold Apple Vision Pro. Continue tips for the best capture. Find a well area. Use a symbol background. Be in front of a neutral background. Hopefully this is good enough. Okay. Remove Apple vision pro to begin capture. Okay, let's do this. Okay. Okay. Let's do this. Okay. When you're ready, hold Apple vision pro at eye level. Slowly turn your head to the right. Now slowly turn your head to the left. Now, tilt your head up. Then, tilt your head down. Next, let's capture your facial expressions. Smile with your mouth closed. Then make a big smile with your teeth showing. Now raise your eyebrows. Close your eyes for a moment. Capture complete. Okay. Hey, let's see what happens y'all. See what happens. Tastes, what, maybe the whole process? A minute, a minute and a half. And there I am. That's me. Oh my gosh. Hello, watch this. The maltracking. Ah, woo! Look, look. You can choose a natural lighting. Studio I think is a little brighter. Okay, I can go to contour. Think it gets a little bit of my stripe, all right? Gets some of the aspects of it. I think with Better Line, my previous one, it popped a little more so. You might wanna try it a few times, but look, it also captures your actual clothes that you did the capture in, which is pretty incredible as well. But look, I'm doing my eyes open, my eyebrows. I'm doing that. This is your persona capture. This is a beta, so because there's so many people and so many different skin tones and sizes and shapes, Apple's making this a beta. It is available for everyone that has Apple Vision Pro, but it'll improve over time. But yeah, that's pretty impressive. You can also change the temperature of, you know, if I come back from Hawaii, I'm a little tanner. That's more like me. You can play with the brightness as well, okay? Let's keep it in the middle. But look, it scans my hands. I can do things with this, right? It shows me like, ah, la, this is my persona. Oh my gosh, that's crazy. Next, oh yeah, I forgot that. Eyewear, if you wear glasses of any kind, you can select different frames. I'm not going to, so I'm gonna go back here and say none and go to next. And there you go. That's your persona that you can save. So after I got my persona locked in, you know, what's the first thing that you would do? Well, I tried to FaceTime call with some friends. All right, so now Brian has joined us. Oh my gosh. Okay, we were just debating like, what's your hair stripe gonna look like? I mean, it kind of looks blended out, right? It doesn't get the spikiness, but it's there. Yeah. Right? Yeah. What do you think about the shape though? Oh, I mean, actually your hair and my hair is kind of like the same shape, Mark. Yeah, yeah. We kind of got a little bit of cone head action going on. You know what I'm saying? But I mean, it's better than anyone else has been able to do my hair so far. So, you know, like you'll never be able to get like a stripe in it. So I'm like, this is cool. But the face stuff is kind of wild. I'm just like still. The faces are impressive, I think. Right? Very, very, it's just at the edge of uncanny valley. Like I know what you guys look like. so I know that they look like you, like the facial hair. Cause have you ever tried to design a character like in a 2K game? Like you try, you really try like as hard as you can to get it looking and it never quite looks like you. This in, what did it take you? A minute maybe? Yeah, basically. I had to do a few tries. Few scans? After a few. Yeah, but the hard part too is the hair too, especially for me, cause it's like you had to have the perfect amount of separation between like your face and the ears because it kept like blurring to the side of my face. So I feel like I can do better, but at this point I was like, we're done. We're gonna go with this. But like whatever you scan yourself in, like that's what you're wearing. So it's like my necklace is crooked. I was like, oh, I need to fix that. That's right, that's so cool. That's part of you now. That's part of your persona. You guys, like you said, we know what each other looks like in real life. And this is like, I mean, I feel like this is like a nine out of 10, like of how we actually look. It's pretty good. And also like skin tones too, because we all three of us have very different complexions too and I feel like it actually, I think it did a pretty good job. Yeah. You know what I'm the most impressed by? The audio right now. Like our mics are attached to our heads right now. They sound really good and they're like positioned based on, I'm like pointing, like you can see my hands, but they're like positioned based on where you are in front of me. Yeah. Yeah. The spatial audio is crazy, right? Good. Like the first time I saw this, I was kind of freaked out, but like the, what are you doing? What do you mean? Are you moving around? I moved you. I'm sorry. I moved you on purpose so I could hear it. Like hear you spatially move in the room. Based on where I was. But then when you move me, you're moving. Okay. Now you're moving. I know, but it's still cool. Wow. Oh wow. Yeah. You're over here now. Exactly. Like I could put you behind me in the room. I'm going to put you, I mean, it's weird for you to see, but talk real quick. Okay. Hi. Oh my gosh. Oh my gosh. Your neck is like broken. I'm behind you. Oh my God. Now you're a shadow. I'm back. I'm back y'all. Wow. So something that just kind of was so shocking for me right now is I just put you guys into an environment and it completely changed the sound. Like, so when I go out of my environment, it sounds like you're in my room, but then it switches to now you're in Joshua Tree. Like it muffles it. I'm in Mount Hood right now. Yeah, it's like the deadness of no reflections of the wall. And like, I can kind of hear like an echo of your voice, like bouncing off the rocks. This is so weird. Yeah. Wow. Geez. Man. It's a lot of like that whole immersion stuff. The immersion stuff is so crazy. Like how good it is. When it's like the attention to detail too. Like I know we all make fun of Apple like, oh, when Apple does something like that, it's going to be a thing. But man, they really made this super impressive. I did not realize that that yeah, when you just said like the audio changed and I tried it, I didn't realize how much it made it feel like you guys are in the room with me until it changed and now it's like yeah I did mount hood also and it's like now we're out in the wilderness and it sounds like that that's crazy that's so it's just it's so shocking so you can even see during the call if I actually move the video box you know from on my right side they will actually see kind of a side profile on my face if I move it over to my left side they'll see a side profile so there's a little bit of spatial awareness but also when you talk about spatial you've got to talk about spatial audio now there are two audio pods here and these are incredible I actually yeah I tried using air pods here at home but it sounds so good it obviously feels so natural where you don't have to have anything over your ears the the spatial audio and just the audio period that is produced in here is incredible depending on where someone's located on the screen you feel that directional sound spatial audio whether it's movies but with FaceTime you know video conferencing and every moment that I've like experiences it is definitely an immersive experience I mean one of the most immersive and the audio pods they just sound awesome another mode that the Apple vision pro has is travel mode so you can take this on a plane and basically it compensates and calibrates for you being in a moving environment or I guess a moving vehicle right now I believe it supports just airplanes but I'm gonna try it out I'll have a video on my channel but i wasn't able to experience that yet because this product hasn't even come out you can't just go out in public with it another big thing that people want to know about this what is the vision pro like for gaming right so we have support for ios and ipad os apps i mean gaming on here is pretty ridiculous let's say if you uh apple arcade games there's about 250 games on launch so think of this you have a controller that's tied to connected over bluetooth and you can basically just have something around it feels like around 150 to 200 inch screen smoothly just like drag and change the scale of it the fidelity of the image and the resolution of those games does not break down so it doesn't get like all super extra pixelated the the image quality still still holds true. And then you have other apps like Steam and Steam Link. You could actually have a game on your PC, on the same network with the controller and use that window, blow it up really big. You can take Apple Arcade games, blow it up really big. This is arguably, if you wanna use it that way, your largest, biggest and best gaming display in your house. A lot of the games here on launch, they aren't what I would call like full takeover VR type games. This is gonna take time for developers to get at it. So there's fun games like Stitch where you're like, you know, drawing in, kind of like, it's like a color slash puzzle game. There's stuff here on launch, but you know, you gotta wait for developers to really get their hands on it for us to see, you know, games tailor-made for this. And that's what I hope to see. Now, if there's one word to describe the Apple Vision Pro, that word is immersive. This is the most immersive headset I've ever experienced. You know, I gotta use it and test it out in half an hour hands-on experiences before this review, but now that I've had it, from an immersive video standpoint and experience, this thing is incredible. I mean, you first have those environments that really transport and take you away from where you are, whether you wanna do work while you're in an environment, whether you wanna watch a movie, you know, Haleakala, you have Yosemite, you have this like cool sand area. You have Mount Hood. And they have daytime versions, nighttime versions. They can also change, like the weather can change as well in here, but they really transport you to different locations. You even have something like the meditation app that you feel like you're in a different world. And then when you start talking about actual immersive video content, right, We have the Apple immersive video platform. There's a rehearsal stage with Alicia Keys. And this is, again, their acquisition of NextVR. You're watching 180 degree video, all right, in front of you. So it basically covers your peripherals. It's shot in 8K. It's 3D and it supports high dynamic range. This just, it's incredible to see this and you feel it, if that makes sense. you actually feel the video and there's not anything out there like that today. And then spatial audio on top of that, that has been able to capture that just yet. Also, we talk about 3D movies, Apple TV will have 150 3D movies available on launch. If you already have purchased the movie and it's available in 3D, you have the option to either watch the 2D version or the 3D version of the movie. This is also incredible because you're, Of course you're wearing a headset, but you're not wearing actual glasses that sometimes you get a screen door effect. When there's a lot of action, the frame rate can break down a tiny bit, but this is the best looking 3D that I've ever seen. And I was the 3D junkie who bought the Panasonic TVs back in the day and bought all the different 3D glasses and bought a huge collection of 3D movies and now TVs today don't support it. This is the best fidelity of a 3D experience we've ever seen. It supports high dynamic range and also sports high frame rates. So that means movies that are like 48 frames, like a avatar way of water, you get the original director's intent in a headset like this. You throw in the spatial audio. It's just incredible all the things that can do. And then look, I just had to add this part here because it's important. When we talk about the I word, immersive, so when you watch a movie, you can go into the cinema view and Apple teased that. It just doesn't translate as well in the headset and it's really shaky, but you can actually get the prime spot whether it's a middle seat, front row, back row, or even up on the balcony and the theater that you're in changes perspective while the movie transitions into these different locations. It is special and when we talk about just being in an immersed environment, that is another way it does it. And then, on top of that, you have the ability to take and record spatial photos or spatial videos from either your iPhone 15 Pros or take them directly on this device. You have this top button here on the left side and that allows you to, when you tap it, it puts you in kind of the spatial capture mode. You either hold it for video, you press it once for single photos, it saves them directly to the device, but on your phone, you kind of get that large, wide landscape aspect ratio for videos and photos. And so that's my preference. Then you just airdrop in here and you can really capture intimate moments that just come alive on this headset like nothing you've ever seen or experienced before. So we're talking about from top to bottom. Apple immersive video, 3D movies, immersive environments, and your own personal spatial video. This is the most immersive headset we have ever seen. And from someone who loves to consume content, this is really special. Now, of course, the question is, okay, Brian, you're talking about this battery life. What do we got for battery life? Well, you know, with normal use, Apple said two hours. And then with watch and movie, Apple said two and a half hours, but what I can tell you is I put this to the test. I've been wearing this a whole lot just for you. And which is normally normal use. time out running multiple apps doing the FaceTime calls even playing like YouTube TV on the side while I'm doing other things playing music I was able to push this out for two hours and 26 minutes so it's almost for time out two and a half hours of normal day-to-day use and I was pushing a lot harder than I even would in a normal way but that's good to know right at least from a from a day-to-day real world you're basically getting around two and a half hours now for watching a 3D movie, I made it all the way through Avengers Endgame, and then I just had like a couple minutes extra of juice. This headset for a movie, 3D movie, lasted three hours and nine minutes. So what that tells you is that both of the, whether it's using it for regular use or using it for movies, both were about half an hour more than what Apple officially stated battery life-wise, which has been typical for Apple, but at least you know now. It's really, real world two and a half hours of day-to-day use and then three plus hours of watching a movie and that's really incredible now you have your battery right if you need to recharge it it takes one and a half hours to go from zero all the way to 100 i did just for fun a 30 minute charge and i got it to 37 so yes you do need a battery pack and there will be caveats that come with that as well So look, I've been saying a lot of great things about the Apple Vision Pro and again there's nothing out there like it but there's obviously this is the first gen there's some things some drawbacks that you need to know about and I'm sure some of these things that are missing will likely you know come in time again this is this is day one of this device but I think the bait one of the first things I notice is you know you download all these different apps but there is no app customization right now meaning afters Apple's apps on the home screen the rest of the apps are actually listed alphabetically, so you currently cannot move them around or customize the layout, create a different order, or even create folders to group your apps together. You do have compatible iPhone and iPad apps. Those are in the compatible apps folder. You could also use Siri to launch an app specifically, or you can go to Control Center and then use Spotlight to find an app. But right out of the gates, you're kind of thinking that, oh I can customize this like iOS, you can't right now. We also have YouTube and Netflix, right? Those, they do not have native apps, they don't have compatible apps that they ported over from iPad OS. So my hope was that I could go to the website and then add it as an app on my home screen. You are not able to do that. So that's pretty inconvenient because look, Netflix, YouTube, and YouTube TV, Those are three services that I use quite a lot and I'd like to at least be able to, hey, take that webpage and turn it into a web app. You can't do that right now as of day one. So it is inconvenient. My hope is that this gets resolved. And so for now, that's something that you can't do now. Will this stop me from saying, oh, get this device? I think it's obviously an inconvenience, but let's give them the benefit of the doubt and I'm pretty sure it'll be worked out. but what you could do right now is set one as your homepage in Safari as it launches or create them as favorites. Now also, things to be aware of, right? This is a list of more caveats, battery swap, right? Now remember, this device, it hasn't changed. Once this battery runs out, if you wanna change over to a new battery, there is no time where, oh, it has like, you know, you can't like hot swap it and this is still running. The actual Apple Vision Pro will shut down once you remove a battery and connect a new one. But the time is not too bad. I mean, I put in a battery fully charged from start and you know, from a cold start, it takes about 37 seconds to warm up. You're gonna hear this deep, bright chime that is a little different sounding specifically for Apple Vision Pro. And once you hear that chime, you can put this on your head and then in about five more seconds, you'll see an Apple logo, and then the video feed shows up inside the Apple Vision Pro, but right now, once you swap batteries, the power will turn off, and then you'll have to wait for it to boot up again. Also, I think one of the things that I noticed over time is movie lens reflections. And what do I mean by that? So, you know, this happens in other VR headsets, but specifically when maybe there's some really bright scenes. It's kind of funny, like the displays are so good, and the high dynamic range is so good. When you have certain scenes in movies that are really bright, it'll sometimes reflect, because you're looking through lenses, and these are curved lenses, you'll see a little bit of some reflections on the edge. Now there is a really sweet spot to see the video like when you're watching movies, but it can happen. And look, I'm just letting you know that. It's not something that is going to, you're gonna hate. I think the ultimate video file will probably be a little annoyed by it. I notice it because I'm the person who gets the 4K OLEDs and pays attention, all that stuff. So it's a little distracting. It happens in some scenes. But also, I notice because a lot of the demos are typically in bright rooms. When you're in a bright room or bright environment, you actually don't really see the reflections that much. It's only when I was pitch black in a room or pitch black in an environment where I could see a little bit of it. It's just something to let you know it's really dynamic scenes that are bright. Now, I think the biggest thing that everyone knows and has heard about it is the weight of the headset. And I will tell you that you will feel this, right? 30 minutes in, for me, it gets a little uncomfortable. 45 minutes to an hour is really the most that I can use it for straight through. But like I told you, to test using it day to day, I kept it on for almost two and a half hours. To watch a movie and see how long it lasted, I kept it on for three plus hours. But I know that in a normal situation, if I wasn't doing that for y'all, I would not be able to wear it that long. I personally need to take breaks. So for me, 45 minutes to an hour was the absolute threshold for me to be like, I need to take a breather from this. You know, even I'll be honest with you, after two days, I didn't realize it, but I touched over here and I got, you know, this is an all new device. This is things that we haven't done before. I got a little bit of tenderness around my forehead after two days. It didn't stop me from using it, but I did feel it and that was something different. So for me, someone needs to make a headset that can help distribute the weight better. There is the dual band loop that does help, but even with that, I still, after, Once I hit that 45 minute mark specifically, then I'm like, oh, I need to take these off. I might be able to push it out to an hour, but that's when I felt that some of you might feel it earlier, some of you might not. I think that quite honestly, people with bigger heads, it helps distribute the weight a little better for you because it's pulled wider, but I hope either Apple works on making something that has a little bit of a counterweight to pull this off your face. We know like with other brand, like Meta, the Quest 3 and the Quest 2, They've had that elite strap with like the battery pack here that just helps lift it a little bit. The weight difference here, this is around 600 to 650 grams. The MetaQuest 3 is like 515 grams. So this is a little heavier. It's not significantly heavier, but no matter what, every headset you wear, you will feel the weight and I felt the weight here. So I'm hoping that we can get other head strap options that might alleviate that a little bit. The other thing that I didn't really think of and didn't expect is when I use this, I think I get a little more exhausted than normal because there's just a lot, I'm overstimulated. Like this is definitely using our brain in different ways and there's so much sensory overload from the video feed, from me looking around, from me like swiping in graphics, from things just like coming at me. I can tell that I definitely get a little fatigued after using that, so that's why I also need to take a break. And again, to my point is, I think this is triggering our brain to act and take in information just because there's just so much there and it's exciting. Like, don't get me wrong, it is really fun. And I love being inside it, but it can also be a little exhausting from overstimulation. So I think maybe part of it is I've been a week into it now, I'm learning to maybe slow down the way I use it. A lot of times when you're looking at things because you wanna jump around so fast, you might wanna tap to select something and you're already looking at the next thing. Just take your time a little bit in it. Also, I did test it using it in the dark more. And when it's too dark, it will tell you where it may not be able to see your hand as well. There are IR illuminators here on the bottom that you can still use this in the dark, but when it gets too, too dark or certain situations, it will warn you that it may not be able to see your hands as well, but it still can be used. I didn't have a problem with it, but I just want to let you know that even sometimes like some of the sensors, it would at least give you a warning when it couldn't see them as well. So just be aware of this. I think this definitely performs the best in well light conditions. It doesn't perform poorly in darker situations. It just may not be as effective when you get those warnings. But also I think another thing that I've noticed that I wasn't expecting is this tap move. You know, when we were using the iPhone, we were using like our thumbs a lot and I would always joke like, oh man, I'm building iceps. This tap move, I mean, when you're using it so much, you even get fatigued here too. So again, we're using these new devices in different ways and our body is having to adjust to that. But guess what? We adjust. This thing is still unreal. So we've talked all about that. The caveats of what makes this great? What makes this special? How immersive this is? And then some of the things that, oh, maybe you might consider, okay, what are some of the challenges that come with this for the first time that Apple's put on a headset? But I think obviously the biggest thing that everyone talks about is not only the comfortability, is that a word? How comfortable this is, you know, the weight of the headset, but the price, right? And let's be honest, I've said this multiple times, this is not priced as a headset for everyone. We know this, right? I don't expect everyone to go out and buy this, but everything I've shown you, it's up to you to make that determination of if this is worth $3,499 starting. You saw my pre-order video, It pushed up because I got an extra battery, I got the highest capacity, I got AppleCare. It basically pushed it to near $5,000. That's a huge investment. I cover tech for a living, but that's a decision that you have to figure out for yourself. I think, first of all, no matter what, through this whole video, this is a device that I highly recommend that you go to an Apple store if there's one near you, go through the demo process, feel it out, experience it. I think it's gonna be really exciting, and you're gonna be like, oh my gosh, oh my gosh, but just do that first before you make a decision. I know there's a lot of people that bought this and purchased it sight unseen, and that is the true Apple believer, also someone who just wants to be on the cutting edge of tech. This is the cutting edge of technology. There's nothing out there like it. We will see what the future holds and what direction this pushes things and where people move towards, but obviously Apple's in this for the long haul, but you've gotta try it on for most people. This is a huge investment. This is a luxury device, but I'm loving it. I'm already loving it. I can't wait to see where this is, honestly, in three to five years when it's gonna get lighter in weight. It's gonna get more comfortable. The price will likely be a little more affordable. I'm not gonna, no, everyone who's asking for a $500 headset from Apple, that's not happening anytime soon. This is the Vision Pro, and this is just the build quality alone would not get it to that area. So don't think of it that way. Look at all the tech in here, and look at all the experiences that I've been trying to convey to you, and this is an incredible, incredible piece of technology. This is up to you to decide for yourself. Is it worth it or not? And also all that chatter about this is a beta product. Using it, it doesn't feel like a beta product. You know, this is a polished product. Developers, yes, have to get on it. The price is not, you know, the most consumer-friendly. It's not. We can all say that, admit that. But for people that haven't used it, that are just outright calling this, you know, a dev kit, I think that's selling it short and use it just from a pure entertainment standpoint, it's prime time already. And again, it's only gonna get better. Like I'm excited to see what developers do and what Apple does with this product over time. I think if you love tech and you want to experience something you have never, ever, ever have before and you have the resources, then you should get an Apple Vision Pro. If you don't have the resources to do it, look, don't do it. Like these are the grown up decisions that we all make for ourselves. We all value things differently, right? It's up to you to decide if it's worth it to you. after everything I've shown you because for everyone that loves their fancy handbags, and I know a lot of you have multiple handbags, hey, this is my fancy handbag. And you know, if it's too expensive for most people, which it is, like, I don't expect everyone to get one. I really don't. Just follow along with this journey. It's going to develop in so many incredible ways. We still don't know if this will be a true success, however that's defined, but we know that Apple is in this for the long haul. You know, all of Apple's DNA is in here from design, from software, from compatibility with all their other platforms and products and, you know, even the media relationships they have. Like this is everything, you know, for all these years put into here. And every time I jump in, it just feels like I'm using the next frontier of computing and entertainment that is just right on the horizon. We'll see if we actually get there. We'll see if everyone gets there. Right. there's still considerations the comfort the price yes but the experiences that this has that they they they they're already they're already changing my brain a little bit like this is really wild stuff i mean as someone who's loved tech and has followed this for all these years that when you see something like this that can do that to you like that's what it's all about it is appropriate that the timing of this comes um just within a week of the 40th anniversary of of the Mac because that was a paradigm shift in how we saw computing and how we worked and interacted with computers and how accessible it was. This feels like another shift that is happening and could happen. I'm not saying it's going to, but the way that we interact with Windows and media and content and the immersive nature, I'm not saying like we're all going to be wearing these outside every day, but all the learnings that are coming from here and as this gets smaller and lighter it's it's going to take us in new places and this this really feels like it introduces a whole new world and a whole new shift of what is possible with technology and bottom line look this is the most amazing piece of tech that i have ever ever experienced in my life and this is just scratching the surface of its potential and that is an exciting uh development in itself you know you wonder like am i saying go run out again right now no you don't have to follow along make the decision for yourself you're a grown-up but hopefully what i showed you um could really inform you and be like oh wow i see why this is special or what this does and why you really yeah it's a headset but you can't you can't compare it to anything out there you just can't there's nothing out there like that so if you want my final verdict right Good Apple, bad Apple, guess what? Nothing like this has ever been done. This is a blow my mind Apple. I still can't comprehend like everything that I feel about this thing. It's freaking incredible. Apple Vision Pro, you blow my mind.", "sentiment": {"positive": 0.837, "negative": 0.163}, "practicality": {"practical": 0.536, "unpractical": 0.464}}, "iJustine-Unboxing&Review": {"text": " Everything that Apple has ever done is all leading to this. The Apple Vision Pro. Here it is! Spatial computing is the newest term that you'll hear be tossed around and until you actually experience the Apple Vision Pro in real life, it might be hard to grasp. Now I know it was for me until I put this headset on for the first time and everything just clicked. ability to transport you into another world while staying inside of your comfy, cozy Apple ecosystem is what really sets this apart from other headsets. Of course, the price does as well, but this really is unlike anything I've ever experienced. The entire headset is so nice, and everything feels like a high-quality Apple product, as you'd expect. It's got this beautiful aluminum frame with a digital crown and this button right on top. It kind of looks like a stretched-out Apple Watch if you really look at it. The front is made of a custom curved glass, and under it is actually a display that will showcase to the outside world when you're watching content or it'll display a visual representation of the user's eyes when you're talking to someone. Now the inside is an ultra high resolution display that has 23 million pixels across the two displays, which is more than a 4K TV for each one of your eyes. The most impressive thing about it though is the way that it just feels intuitive as soon as you put it on. The natural way you just look at something and you make a pinching gesture to select it and it just freaking works. It truly feels like you're witnessing a miracle. Now before we get more into this, let's do my favorite thing and unbox it. I'm gonna have a heart attack because I'm sweating and I'm so nervous. Okay, okay. Let's unbox it. Oh my goodness. Are you guys ready? Because I'm not sure if I am. Oh my goodness. Here it is. Apple Vision Pro. I like its little protective hat and it matches the solo knit loop. It's just, it's got such a little cozy vibe. This thing is just sitting there right in the box and it is ready to set up. Oh my gosh, this is really just, it is kind of a monumental moment. Whoa, okay, that's kind of cool. Check this out. Like it's just sitting there. It's perfectly, like it doesn't move. doesn't go anywhere. It's just like floating. Oh my goodness. Okay. I want to take off its little, little cover. Take a sneak peek. Ready? Oh shoot. Check that out. Look at it. This is the future. The future is in my hands right now. Oh, it's so soft. Like this is something that I wish they made like a sweatshirt out of this because I would wear it 100%. Let's see what else is in the box. I'm gonna put its little cover back on. Shh, go see. So what have we got in here? God, she's so lucky. Like she is, she is vision pro. She is everywhere. So here's everything in the box. You get it. Now inside here is our dole band loop. So this does come with two different bands depending upon which one fits your preference. I kind of like the dual loop band because it seems to alleviate a lot of the pressure of the device. Here it is. It's kind of just like a big Apple Watch band, but for your head. We've got a USB-C cable. We've got the battery pack, which is such a beautiful battery pack. Like if Apple made one of these just to like charge my phone, I'd buy two. Think about it. And this is a little little connector that goes into the side. It isn't MagSafe, it is actually mechanical. So you do have to place it in and then turn it, which is good because this keeps it in place. If it was MagSafe, you don't want this turning off mid activity. And we've got a charging brick. What's in here? We still have more things. A polishing cloth. Can you even believe it? Oh, this is a nice, so this is a Special Vision Pro polishing cloth. It's a much thinner texture than the polishing cloths that they have for your computer. Also smells new and fresh. Okay, I haven't seen a sticker yet. All right, this is the extra light seal cushion that they give you. There's one that's a little bit thicker, so depending upon the fit, you can figure out which one's right for you. So here's everything that comes in the Apple Vision Pro box. We've got our headset, external battery pack, charging brick, USB-C cable, polishing cloth, extra light seal, the solo knit band, and the dual band loop. The other thing that we have to unbox to show you are the Zeiss optical lenses. Now this is something that you can order if you have prescription lenses. You can get them if you're near-sighted or far-sighted. Now these are just some readers as a demo to show you how to insert them. They go in magnetically, so if you do wear contacts, you don't actually have to buy these. So I'll show you how these work. There they are. So these will just pop right on like inserts to the Vision Pro. That's it. And they're on. That was easy. Now this is the Vision Pro case. Obviously it is sold separately. It's a little wrinkled. I think that's the style that they're going for. I'm kind of into it. It's a nice fresh white. And up here we've got the Vision Pro travel case tag. Let's open it and see what it looks like. I like this nice little handle here. It actually comes out a little bit so you can carry it. So squishy. Like actually this could be a nice travel pillow. Like I 100% would use this on the plane. Like I would, oh it's so soft and so, so nice. Look at that. Vision Pro travel case. We've got some documentation. Okay, so it shows you how to put it in. Cause I was curious. Okay, so that's where you clip in the battery. A little baggy. Oh, it's a little accessory pouch. Oh, that's so nice. Now we put Vision Pro in. And this is cool. I got like a little adjustable slider because depending upon what size light seal and cushion that you have, you might need to adjust it. So I do have the small. So pushing that all the way forward. We've got this cute little bag to put all of our accessories in. Check this out, look at this. I see why this was so expensive because it is a really nice case. I get it. And there we go. Apple Vision Pro is ready to go. This does have a travel mode, so if you are on a plane, a train, or if you're the passenger of a car, you can set that into travel mode so you'll be able to use this while you're moving. I won't be testing that out here in this video, but stay tuned for a future one where I take it on the go and see what it's like. Now the moment that we've all been waiting for, let's set it up! All right, so I wanna give you guys a little look at the headset. So obviously we've got our little cover on here. So when we take it off, we are greeted with this beautiful front display. Now this is a modular system. So if we don't want to have the solo knit loop, we can just pop this right off. We've got these little pull tabs right here. You can just pull, pop them off, and then we can just put on the dual loop band. So what's cool is if you do want to give someone guest access and they have a different size head, you just need to order the different size light seal and the cushion, and this will allow you to just swap this out to give someone access to guest mode. Now this device can only be registered to one person, so using Optic ID, this will basically be sealed to you. They will be able to go into guest mode, so we'll test that out later. Gonna take off our little, like it kinda looks like a bra. Like I'm just gonna say it, like it is what it is. I'm so nervous, like I feel warm. So you just line up the little dots to the circle and then you rotate and we are dialed in. So you'll see there's a little light right there. It's blinking. Now it's gonna keep blinking and as soon as it turns solid, then the headset is ready to be put on. There is an initial setup process that you have to go through. You only have to do this once when you first get the device and then it'll automatically be calibrated to you. The coolest thing though is the way that this is able to detect your eye tracking. Looks like we have a solid light. It's time to go in. I can't believe this moment is here. So the Solo Knit has a little tightener right back here. So you just tighten that to get a nice snug fit. I'm gonna press this to hold to align my eyeballs. Oh my gosh. It's happening. Whoa, there's an Apple logo that just popped up. I can see, I can see everything. I see you, a little hello has just written itself across my screen. Oh my gosh. All right, so now it's telling me to bring my iPhone, iPad nearby to get started. So let's set it up. This is crazy, so I'm using my phone right now and it's like I am seeing with my real eyes. All right, so this is the first time that you guys are seeing what I'm seeing. The cool thing is basically on day one, we're gonna have access to over a million apps because of the app store. With all the iPhone apps, the iPad apps, A lot of these are compatible with Vision Pro, so it's super exciting that we will be able to use a lot of those apps seamlessly right on the Vision Pro day one. This is what the Vision Pro app store looks like. Now the tech in this thing is what is really so impressive. Just the cameras and the sensors alone and the way that they are able to duplicate such a real life experience with the pass-through video. There's two main cameras on the front, two on the side, two IR illuminators, four downward cameras, two true depth cameras, and a LIDAR scanner right in the front. With all of these, this lets you casually have your hands placed on your lap, to the side, or really almost anywhere, and still be able to pitch to select. Now doing a FaceTime in Vision Pro, I will say is probably one of the wildest experiences. Oh my gosh. Okay, we were just debating like, what's your hair stripe gonna look like? It kind of looks blended out, right? It doesn't get the spikiness, but it's there. Yeah. Right? Yeah. The faces are impressive, I think. Right? Very very, it's just at the edge of Uncanny Valley. Like I know what you guys look like. So I know that they look like you. This is like, I mean, I feel like this is like a nine out of 10, like of how we actually look. It's pretty good. And also like skin tones too. Cause we've all three of us have very different complexions too. And I feel like it actually, I think it did a pretty good job. Every single time I get on a FaceTime call with this, it's the same reaction of, whoa, like this is weird. Yeah. And I realized I've gotten used to it. And I think after a while, everyone using this is just gonna get used to it after you get over the initial, holy crap, look at this thing. Well, thank you guys, this was cool. This is dope, this is dope. Thumbs, thumbs, I see I saw more of one of his thumbs. There it is. Okay, bye y'all. See ya. Bye. So now that I have everything all set up, I wanna take you through how to actually use Vision Pro. This is the, I don't want to say it's even challenging because it's super easy. So if this is the most challenging part, then you're going to be set up for success after this because it's so simple, it's so intuitive, and it really is amazing how accurate the eye tracking is. It's made me feel really strange now in the real world because when I'm looking at something, it's hard for my brain to comprehend that I can't look at it, pinch, and bring it closer to myself. Apple Vision Pro side effects. All right, I'm going in. Okay, I'm now inside and as you can see, I can see everything that's happening here. So we've got a little studio light here. I've got you right there, my camera, hello. Got Armando over there, hello. And it doesn't feel like I've left my living room. Like I am still in it. Now the interesting thing is it's so realistic, but also it does have that slight feel that you're looking at a screen. So it is kind of confusing to your brain, but for the most part, I feel like I'm looking around and things just start popping up. And it's so unbelievable that I, it's hard for me to even articulate. But let's just go through and let me show you some things on how this works. So this is the digital crown. And when I press that, that brings up our main menu here. When I want to go and open something, I literally just look at it. So as you see each icon kind of getting a little bit highlighted and a little bit bigger. Now you just use the pinch gesture to pinch and select things, and I'm using it to slide through the menus. And that is basically, that's it. Now we're gonna go into some settings and I will show you my persona that I created. So here it is, this is my persona. Now I created this using the Vision Pro. You hold up the Vision Pro in front of your face. Oh my gosh, you can even see my hands, like this is wild. And you go through this process where you scan your hands front and back, and then you hold the Vision Pro in front of your face. So you take it off of your head, hold it in front of you, and you follow the directions. You look left, you look right, up, down. You smile without your teeth, you smile with your teeth, and then you raise your eyebrows, and then you close your eyes, and that is all it takes to create your persona. And this is in beta, so it is all still a work in progress, but you'll actually see that it gets all of the details. I wish I would've fixed my necklace for this persona shot. So you can see it's a little bit crooked. So it does get the details pretty good. I'm gonna close out of here. I looked at the X, I closed it. So now down here at the bottom, you see that big line? That allows you to move the windows. So you look at it, and I can move this and put it wherever I want. I can move it. Oh my gosh, it's so close in front of my face. Now you can also resize this window by looking at the bottom corner. This is in my space. I have a Safari window open right here. So now if I look at the microphone, that'll allow me to use voice to text. YouTube.com slash I just seen. So here is my YouTube channel. Now I can go and scroll through and it's just so intuitive. You look at something and you click it. Now, when you see those hyperlinks becoming active, those are things that I'm looking at right now. So I'm watching this video. I don't wanna be here anymore. I wanna be somewhere else. I'm going to go to the moon. So there are all sorts of different environments that you can choose from. Right now I'm at the moon. This is full environment. Like we're, oh my gosh, my hands. It's still shocking every single time. Now there's other locations that I can go to. So when I look up here, this takes me to the control center. Look at all of these that we can choose from. So let's go to Haleakala. I always mispronounce this, but this is an incredible place in Hawaii. I've actually been here in real life. I am watching my own YouTube video on this beautiful, beautiful island. If I decide that I don't want to be fully immersed, I can dial this back and you'll see that it goes away as you dial in the transparency. So the headset lets people know if you're actually looking at them or if you're looking at content. So obviously I am watching some content right now. Now, if anybody else is around, they will not be able to see my eyes, but because I have my digital persona already added on here, my eyeballs will show up when I'm paying attention or talking to someone else and I'm not watching content. So right now I'm fully immersed. Get, hi, oh my gosh, no, you're showing up now. And you're actually showing up more clear as I talk to you. Yeah, I could see your eyes. It's kinda cool. There it is. Wow. Cause it's like, I'm seeing you, but you're also wearing these goggles. But I'm seeing you kind of like, you just sort of like appeared out of the rocks. Ah! It's so cool. All right, so right now I've opened up iMessage and I have a chat here with Armando, who's over there ironically, and he's texting me. So it's cool because I can have our chat just be right up here. This is gonna be a great opportunity to show you guys the virtual keyboard. So I'm gonna write back, the keyboard pops up and I can put this wherever I want. Now the typing on here is so wild because it kind of feels like I'm actually typing. This is all too much for me to handle. Now there's three ways that you can type. You can use your voice, you can look at the letter and pinch or you can actually press the keys. So the first thing that I'm gonna do is I'm gonna use the actual keyboard. So here we go. I push the key. Yes. I And then I'm gonna look up there and I hit send. Now I'm gonna try just looking at the letters and pinching with my hands. Now you don't have to make like a huge gesture. You just, it's just a simple little pinch. Send. So I'm gonna use my voice. I'm gonna look at the icon. Actually, I changed my mind. I want pizza. Thank you, bye. There we go. What if I can add an image, can I? I can. This is basically just like freaking iMessage. Okay, let's see. Okay, now I'm sending you a pizza party. Okay, cool. Well, I'm gonna keep our chat just right up here above my YouTube video. So I'm also not bringing up like my notes and all my stuff because I have all my information in there. So you can use all of these apps just like you normally would. So I'm gonna open up Keynote. Let's make a new presentation. Oh, I can connect a keyboard. Okay, now I have just, I've got a workstation here. Magic keyboard, there it is. Connect Magic Trackpad. Oh my gosh, look at this. The mouse cursor, it basically is like the little cursor that shows up from like the iPad. Okay, oh my God, oh, this is so cool. Okay, I'm shocked because this is the first time that I'm actually trying this. Vision Pro is so cool. Oh my God, this is amazing. This makes it so much easier because I feel like a lot of the eye fatigue that I'm feeling is from excessively like looking around. And I think as I use this more, I'll get used to it more. Where right now I think I'm like actively looking at something because I know that's how I select. Whereas I feel it becoming more second nature and it'll be less, I feel like exhausting after a while. This is mind blowing to me. Okay, so I've still got our chat up there. Now I wanna find an image. It's so cool because when I start typing, it just automatically, the keyboard just goes away. So if I wanna copy an image, I just look at it, I hold it, copy. I'm gonna look over here, delete that image. and let's see if Apple V works. It does! I just pasted it. Now, if you do wanna paste this, you just do the same action. You just hold this in and it'll bring up a little selection and you can click paste. I'm also recording over here, if you guys are curious what this is for, that's how I'm screen recording everything. And hopefully I'm not making you completely nauseous by looking around everywhere. This is pretty awesome. Okay, I'm gonna go into this presentation mode and I can choose an environment for my rehearsal. So we are gonna go and transport to the Steve Jobs Theater to rehearse for my presentation. Hello everyone, welcome to the Steve Jobs Theater. It's Justine. Oh my God, I would probably die to be standing on the stage at one point in my life. Well, my presentation is actually back there. Dude, this is wild. Are we manifesting right now? I think we are. I wonder if I stand up, if it'll, if I will stand up. Okay, when I stand up, it actually, okay, you guys can see this because I'm screen recording, but it actually knew that I was standing up and showed me my surroundings. So it's not giving me the full view, so I don't hurt myself, which is actually pretty freaking awesome. There's my beautiful work of art that I just did. Wow, oh my God, I can even see the carpet. Okay, I gotta sit back down. Okay, now that I've sat back down, everything has come back into view. So that's a really cool safety feature and it happened so quickly. I have a laser pointer? How does that work? Look, oh my gosh, look at the laser pointer. This is so cool. Look at this. I'm losing it. This is so cool. When I'm having a bad day, I'm just gonna come in here and I'm gonna sit in the Steve Jobs Theater and just make presentations. There's now a whole new app store for Vision Pro. So let's go check out some of those apps. I've already downloaded a few when I did my setup. There's a really cool hiking one that I saw. I wanna check that one out. Hiking and skiing peak visor. So I've now connected into the immersive map. Here it is downloading. Oh gosh, this is gonna be so cool. Oh my goodness. Look at all of this. Everywhere that I look, I am, I am swimming in the mountain. Yosemite Village, tell me more about it. And then it just pops up right here. It's like up to my neck. Choo Choo Mountain is, it's on my neck. Check out this cool hike in Yosemite. We should do it one day. It's called Choo Choo Mountain. Choo Choo, Choo Choo, Choo Choo Choo. Come over soon and try out Vision Pro. That was way cooler than I actually thought it was gonna be. Oh my goodness. Oh my goodness. Oh, oh, hello. You go back where you belong. I feel like a god. Oh. What? This is so cool. Also, if you wanna recenter your little icons, you just have to press and hold on the digital crown, so that'll give you a different view, just like so. Now it's time to test out this app that I have been dying to show you. This is the DJ app. So here's what it looks like normally on the iPad. You can bring this into your space, like an actual DJ set. Here it is! Okay, so I'm gonna move this closer so that I don't have to get up. Yeah, this is great. Okay, check this out. I can pick this up, put it back down. I can scratch. That's not it. Look what else we have. We have effects. Oh, you think that's it? No, it's not it. Look at all of these albums that have just popped up that I can pull out and put down. I probably should stop dancing because you guys are probably seeing my head move around a lot. You thought that was it? We can go into different environments. Oh, look at this! Everything is awesome! Oh, check this out! Look at the tunnel! Oh, sh, look, we have people! Are they gonna dance? Do you want me to change up the music maybe? What's back here? Summer, we love it. Okay, they like this. Now they're dancing. Hey, closed DJ. And we're back in the living room. Let's see what else we can do. Apple Arcade is huge. There's so many games to choose from. You can play iPad apps, iPhone games, and you'd also connect an Xbox controller or a PlayStation controller, a controller through Bluetooth. And I happen to have my Xbox controller here that I actually just use all the time when I play Xbox. And I'm gonna play a game. This is on Apple Arcade, so if you have Apple Arcade, obviously you can play this. So like I have filled this screen, basically as large as I can here on my wall. So as you can see, I'm using this Xbox controller. I think Jenna's here, but I'm busy. Like here we go. I'm gaming, I'm gaming. Hey Maddie. Hi Angel, mommy's playing a video game. Wow, I'm in the future. Yeah, but I'm playing Sonic right now. Come on up, come on up, buddy. Okay, so also what's cool is if I want to go into an environment, oh yeah, this is beautiful. Okay, I'm gonna play my game in peace. Look at this. Yeah, I can still see my hands. So this is something I can't wait to try. I'm going to mirror my display into my headset and edit the video that you're seeing right now. This is gonna be so cool. Okay, we're going in. Well, here's my computer. This is showing a little connect, and that's just popped up. So let's look at it. We're connecting. And now, oh my goodness. My freaking timeline is now in front of my face. Oh my gosh. And that's over the window. So you look at it. This is unbelievable. Okay. The only problem is, okay. I don't know where all my keys are. Obviously I am watching some content. Wow. This is messing with my brain because it looks so good. It's like, look at this. Like I'm just moving this all around my room. The other cool thing is if I wanted, I could bring up any other apps here. I could just have my YouTube channel over here. Like, this is just, it's awesome. Should I bring a dinosaur in? We were editing and now we're not. Look at this little butterfly. Oh my god. It's, it's touching me. I felt that. I felt that. Um, okay, you're, it's so close to me. Dude, I'm honestly gonna, I'm so scared. He's looking at my hand. Wow. That was a lot. So Jenna came over to try out Vision Pro. Now, Now there is a really cool guest mode that you can give access to a guest, and Jenna is my guest today. Okay, so I'm gonna put this on and get guest mode all set up for you, and then we're gonna go through a little tutorial. Ooh, a tutorial. And you will be able to experience Vision Pro! So I opened up the apps that I wanted Jenna to be able to view, and then I hit guest mode. Okay, ready? I think so. Oh, let me get you a fresh cushion. This comes in two parts. On the website, you can actually custom fit these to your face. So this is custom fit to mine, so the seal might not be perfect for you, but I feel like we have same brain, probably same face. Is it like a small, medium, large type of number? They have different sizes, and they didn't say how many different sizes. Here you go. How do you loosen and tighten the bander here? Yep, right there, and then, oh, make sure you always grab it by... Okay, I'm learning. There, hold it to your face, and then give it a nice little... Okay. Okay, so I'm seeing what she's seeing now. So she's holding the digital crown to align it with her eyes. Oh! So, oh my gosh, look at that, I can see my feet! So this is gonna go through the whole process that I went through initially to set up your hands. Yeah, match the hands. I see it now. There you go. Tap your fingers to select it. I'm looking at it. Okay, look at each dot and then do a little pinch to select. Okay, now you're gonna do it again in a different lighting condition. I do like that I don't have to move my head around because I feel like with other VR, moving my head around made me ill. But this I don't have to move it. Okay, it's completing your eye setup. Are you ready to experience Apple Vision Pro, Jenna? Yes, I am. What am I gonna, what do I have to look forward to? Oh, well. The future? You're in the future right now. Okay. So, look at my socks. Okay, so I opened up all these apps already for you. Okay. Oh, boy. Let's see. Hi. Oh my, isn't it weird? It's weird, because it's like I can see through you. Yeah. That's me. But you're not, wow. Okay, so these are my spatial videos. Okay, now look up at the top where it's got that little pano button. It looks like a little, there you go. When people are watching the screen recording of this, it's gonna just look kinda like it looks, I'm watching what you guys are seeing, and it just looks like a tunnel vision. But like, when you're in the headset, what do you see? Oh, I feel like I can touch him. It's like I can, I mean, I am touching him. You are touching him? But, whoa! It looks like it's gonna touch me. I'm so excited to see what these look like. I haven't even seen any of these yet. Literally looks like the leaf is touching me. Okay, so now you're gonna go into a Disney Plus environment, which is one of my favorite things because apps like Disney Plus have the ability to create these environments. Oh, I'm, oh man. Wow. I'm in the theater. You are in the theater. There's a big cup holder. Oh my goodness, how awesome. Okay now, whoa. Whoa. Whoa. This is so. You're gone. Hi. I don't see you. Yeah, okay, well. My hands. It looks like you're petting the table. I can't see. Okay, we're gonna watch Aladdin. Oh, I'm excited. Have you seen this? I think I made you go see it in theaters. My hands are so bright, can you see my hands? I can see your hands. Woo hoo hoo! Okay, so what do you think? What does it look like? It looks like I'm at the movies. This is really weird. Like it feels like I'm at the movies. This is confusing for the brain. I never liked 3D, because it made me kind of sick, but I feel like with this, since I'm not moving my head that much, and I'm not really moving around, it's different. It's a different experience. So unfortunately I can't show you what she is seeing right now in 3D, because of copyright. So you're just gonna have to trust our commentary here. It's like I'm there. I know. Come on out, Jen. Okay, I don't want to. It's fun in here. Welcome back. I'm not in the theater. FaceTime Jenna Ezarik. Oh my gosh, so I have you in the Joshua Tree environment and your little screen is actually showing a little shadow on the rocks that I have you set on. This is gonna be total inception. Okay, so I'm carrying you right now. I'm walking around. Whoa, gosh, you got so close, cause I dropped you. Oh my God, I'm freaking out. I am freaking out, but I can't figure out what's happening because I have this, okay, this is so freaking wild because I couldn't figure out, like you were right next to yourself. We're really having a fun time here. But this looks like you're really there. Nothing, because this is everything. I wonder if I leave you there, if I lose you. Okay, I'll bring you with me. Okay, here we go. We'll be on the TV. So I'm gonna share my keynote with you that I've been working on. Okay. I'm gonna take you into my presentation room. Oh, we're in the conference room. I know, look! And watch this, when I turn around, my presentation is there. It's a very nice conference room. So that's my slideshow. Can you open the blinds? I don't think I can. Okay, okay. Great, I'll do a follow up next week. Okay. Okay, bye! Hi, okay, so I was walking around, I forgot I needed to get something in here, and then I walked back into this room, but like the window is right where I left it. Like it's right here. Like it's, I left the window here in this room and I'm leaving now. Oh, there, okay, yep. Uh-huh, careful when walking around. The window stayed over there. It's where I left it. This is so, so wild. Well, thank you guys for watching. I know this is a long video, but I was trying to be as thorough as possible in giving you guys the unboxing experience and what it's like to actually use it. The only problem is a lot of the footage that I'm showing you, like it doesn't look as good as it does in the headset. Stuff that I'm showing you, it looks perfectly fine on screen, but when it's actually inside of this headset and in your head, it just looks so crystal clear and everything is just so real life that I cannot stress enough how you gotta try it. Like if you're not gonna buy one, I don't, that's fine. Find a friend, hop in guest mode, test it out, go to the Apple store and just use it because it needs to be something that you experience just so that you're getting your mind wrapped around what the possible future looks like for spatial computing, not only for Apple, but there's so many other headsets that I feel like you're gonna be kind of going in this direction. So not only for content creation, shooting spatial video, for advertisers, for marketers, like this is a whole new world and it's here. So, buckle up.", "sentiment": {"positive": 0.776, "negative": 0.224}, "practicality": {"practical": 0.533, "unpractical": 0.467}}}